public class Test10 {

    //掌握下面这些，就能完成一些多线程的开发任务了
        //线程基本概念
        //Thread 类
        // 1、创建线程  2、中断线程  3、等待线程  4、获取线程实例  5、线程休眠
        //线程状态
        //线程安全问题（最重要的）
        //内存可见性
        //wait / notify

    //关于多线程的案例：
    // 1、实现一个线程安全版本的单例模式。 单例模式：是设计模式之一。设计模式：就是“棋谱”，就是固定的一些代码套路
    //      写代码的时候，有很多经典场景，经典场景中，也有一些结点的应对手段。一些大佬们就把这些常见的应对手段收集起来
    //      收集之后就起了个名字，叫”设计模式“。这些套路，就使得一些代码新手也不至于把代码写的很差。
    //      在校招中有两个模式很常见：单例模式，工厂模式
    //      单例模式：代码当中的某个类，只能有一个实例，不能有多个。在实际开发当中，很常见，也很有用
    //          开发当中的很多“概念”，天然就是单例的：JDBC 的 DataSource 这样的对象就应该是单例的。
    // 2、
}
